In [45]:
import numpy as np
import pandas as pd

print(np)
print(np.__version__)
print(pd)
print(pd.__version__)

<module 'numpy' from 'C:\\Users\\USER\\anaconda3\\lib\\site-packages\\numpy\\__init__.py'>
1.19.2
<module 'pandas' from 'C:\\Users\\USER\\anaconda3\\lib\\site-packages\\pandas\\__init__.py'>
1.1.3

In [7]:
#stack , unstack
#set the index name for Dataframe
multicol1 = pd.MultiIndex.from_tuples([("weight", "kg"),
                                       ("weight", "pounds")])
#create EX. dataframe
df_multi_level_cols1 = pd.DataFrame([[1,2],[2,4]],
                                    index= ['cat', 'dog'],
                                   columns=multicol1)
df_multi_level_cols1

    weight
        kg pounds
cat      1      2
dog      2      4

In [15]:
#.stack(level=- 1, dropna=True) :
#//Stack the prescribed level(s) from columns to index
'''
參數 : 
level : 放整數、字串、串列 (默認為 -1(最後一欄))，決定哪一欄位轉為索引。
dropna : 放布林值 (默認為 True)，決定是否要把全為遺失值的列拿掉。

欄位轉索引：將一欄位(column)轉成一索引(index)，使用 df.stack() 即可。

!!注意 .stack() 會由最外層的欄位開始轉換。The new inner-most levels are created by pivoting the columns of the current dataframe.
'''
print(df_multi_level_cols1.stack())
df_multi_level_cols1.index,'\n', df_multi_level_cols1.stack().index

            weight
cat kg           1
    pounds       2
dog kg           2
    pounds       4

(Index(['cat', 'dog'], dtype='object'),
 '\n',
 MultiIndex([('cat',     'kg'),
             ('cat', 'pounds'),
             ('dog',     'kg'),
             ('dog', 'pounds')],
            ))

In [28]:
print(df_multi_level_cols1.stack().unstack(), "\n")
print(df_multi_level_cols1.stack().unstack().unstack(),"\n")  #type :Series
print(df_multi_level_cols1.stack().unstack().unstack().unstack())
df_multi_level_cols1.stack().unstack().unstack().unstack().unstack()

#df_multi_level_cols1.stack().stack()  => type:Series
#df_multi_level_cols1.stack().stack().stack() => Error
'''
df.stack() : 當欄位沒東西時，會報錯。
df.unstack() : 當索引都被移到欄位時，會把所有欄位變為索引。
'''

    weight
        kg pounds
cat      1      2
dog      2      4

weight  kg      cat    1
                dog    2
        pounds  cat    2
                dog    4
dtype: int64

               cat  dog
weight kg        1    2
       pounds    2    4

       cat        dog
        kg pounds  kg pounds
weight   1      2   2      4

In [36]:
#欄位名稱轉為欄位值
#.melt(id_vars=None, value_vars=None ...)
#//Unpivot a DataFrame from wide to long format, optionally leaving identifiers set.
'''
id_vars：不需要被轉換的列名
value_vars：需要轉換的列名，如果剩下的列全部都要轉換，就不用寫了。
'''

import pandas as pd 

df = pd.DataFrame({'Name':{0:'Jiao', 1:'John', 2:'Shiela'}, 
                   'course':{0:'python', 1:'ML', 2:'DM'}, 
                   'Age':{0:22, 1:15, 2:50}})
print(df, "\n")
print(df.melt(),"\n")
print(df.melt("Name"))
df.melt(value_vars='Age')

     Name  course  Age
0    Jiao  python   22
1    John      ML   15
2  Shiela      DM   50

  variable   value
0     Name    Jiao
1     Name    John
2     Name  Shiela
3   course  python
4   course      ML
5   course      DM
6      Age      22
7      Age      15
8      Age      50

     Name variable   value
0    Jiao   course  python
1    John   course      ML
2  Shiela   course      DM
3    Jiao      Age      22
4    John      Age      15
5  Shiela      Age      50

  variable  value
0      Age     22
1      Age     15
2      Age     50

In [37]:
'''
.DataFrame.pivot : Return reshaped DataFrame organized by given index / column values.
.pivot_table : Create a spreadsheet-style pivot table as a DataFrame. **
'''
#重新組織資料
df = pd.DataFrame({'fff': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bbb': ['P', 'Q', 'R', 'P', 'Q', 'R'],
                   'baa': [2, 3, 4, 5, 6, 7],
                   'zzz': ['h', 'i', 'j', 'k', 'l', 'm']})

df

   fff bbb  baa zzz
0  one   P    2   h
1  one   Q    3   i
2  one   R    4   j
3  two   P    5   k
4  two   Q    6   l
5  two   R    7   m

In [44]:
print(df.pivot(index='fff', columns='bbb'),"\n")
print(df.pivot(index='fff', columns='bbb')['baa'])
print(df.pivot(index='fff', columns='bbb',values='baa'))
df.pivot(index='fff', columns='bbb',values=['baa','zzz'])

    baa       zzz
bbb   P  Q  R   P  Q  R
fff
one   2  3  4   h  i  j
two   5  6  7   k  l  m

bbb  P  Q  R
fff
one  2  3  4
two  5  6  7
bbb  P  Q  R
fff
one  2  3  4
two  5  6  7

    baa       zzz
bbb   P  Q  R   P  Q  R
fff
one   2  3  4   h  i  j
two   5  6  7   k  l  m

In [58]:
# Groupby-->  Split-Apply-Combine strategy
'''
Groupby可以同時針對多個欄位做 Group，並在Group中做運算
Split：將大的數據集拆成可獨立計算的小數據集
Apply：獨立計算各個小數據集
Combine：將小數據集運算結果合併
'''
score_df = pd.DataFrame([[1,50,80,70,'boy'], 
              [2,60,45,50,'boy'],
              [3,98,43,55,'boy'],
              [4,70,69,89,'boy'],
              [5,56,79,60,'girl'],
              [6,60,68,55,'girl'],
              [7,45,70,77,'girl'],
              [8,55,77,76,'girl'],
              [9,25,57,60,'girl'],
              [10,88,40,43,'girl']],columns=['student_id','math_score','english_score','chinese_score','sex'])
score_df = score_df.set_index('student_id')
score_df

            math_score  english_score  chinese_score   sex
student_id
1                   50             80             70   boy
2                   60             45             50   boy
3                   98             43             55   boy
4                   70             69             89   boy
5                   56             79             60  girl
6                   60             68             55  girl
7                   45             70             77  girl
8                   55             77             76  girl
9                   25             57             60  girl
10                  88             40             43  girl

In [56]:
#運用索引將資料分開再取平均
boy_score_df = score_df.loc[score_df.sex == 'boy']
girl_score_df = score_df.loc[score_df.sex =='girl']
print(boy_score_df.mean())
print(girl_score_df.mean())

math_score       69.50
english_score    59.25
chinese_score    66.00
dtype: float64
math_score       54.833333
english_score    65.166667
chinese_score    61.833333
dtype: float64

In [57]:
#運用groupby方法值接取平均
score_df.groupby('sex').mean()

      math_score  english_score  chinese_score
sex
boy    69.500000      59.250000      66.000000
girl   54.833333      65.166667      61.833333

In [62]:
#新增欄位class
score_df['class'] = [1,2,1,2,1,2,1,2,1,2]
print(score_df)
#Groupby也可以針對多個欄位做分析
print(score_df.groupby(['sex','class']).mean())
#Groupby也可以同時針對多個欄位做多個分析
score_df.groupby(['sex','class']).agg(['max','mean','std'])

            math_score  english_score  chinese_score   sex  class
student_id
1                   50             80             70   boy      1
2                   60             45             50   boy      2
3                   98             43             55   boy      1
4                   70             69             89   boy      2
5                   56             79             60  girl      1
6                   60             68             55  girl      2
7                   45             70             77  girl      1
8                   55             77             76  girl      2
9                   25             57             60  girl      1
10                  88             40             43  girl      2
            math_score  english_score  chinese_score
sex  class
boy  1       74.000000      61.500000      62.500000
     2       65.000000      57.000000      69.500000
girl 1       42.000000      68.666667      65.666667
     2       67.666667      61.666667      58.000000

           math_score                       english_score             \
                  max       mean        std           max       mean
sex  class
boy  1             98  74.000000  33.941125            80  61.500000
     2             70  65.000000   7.071068            69  57.000000
girl 1             56  42.000000  15.716234            79  68.666667
     2             88  67.666667  17.785762            77  61.666667

                      chinese_score
                  std           max       mean        std
sex  class
boy  1      26.162951            70  62.500000  10.606602
     2      16.970563            89  69.500000  27.577164
girl 1      11.060440            77  65.666667   9.814955
     2      19.295941            76  58.000000  16.703293

In [63]:
# Time sequence
df = pd.Series([1,2,3,4,5], index=pd.period_range("2021-01-01", freq="Y",periods=5))
df

2021    1
2022    2
2023    3
2024    4
2025    5
Freq: A-DEC, dtype: int64

In [68]:
# 可以抓一段時間 (2022~2024)
print(df['2022':'2024'])

#Year -->Quarter
#Resampler.asfreq :Return the values at the new freq, essentially a reindex.
#Serise/DF.asfreq :Convert TimeSeries to specified frequency.
df.resample("Q",convention="s").asfreq()

2022    2
2023    3
2024    4
Freq: A-DEC, dtype: int64

2021Q1    1.0
2021Q2    NaN
2021Q3    NaN
2021Q4    NaN
2022Q1    2.0
2022Q2    NaN
2022Q3    NaN
2022Q4    NaN
2023Q1    3.0
2023Q2    NaN
2023Q3    NaN
2023Q4    NaN
2024Q1    4.0
2024Q2    NaN
2024Q3    NaN
2024Q4    NaN
2025Q1    5.0
2025Q2    NaN
2025Q3    NaN
2025Q4    NaN
Freq: Q-DEC, dtype: float64

In [81]:
str_date = '2021-01-01'
date = pd.Timestamp(2022,6,1)
print("String:",str_date , type(str_date))
print("Timestamp:",date, type(date))
print("\n")
# 字串轉時間型態
str_to_date = pd.to_datetime(str_date)
# 時間轉字串型態
date_to_str = date.strftime("%Y_%m_%d")
print("str_to_date:",str_to_date , type(str_to_date))
print("date_to_str:",date_to_str, type(date_to_str))

String: 2021-01-01 <class 'str'>
Timestamp: 2022-06-01 00:00:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>


str_to_date: 2021-01-01 00:00:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>
date_to_str: 2022_06_01 <class 'str'>

In [88]:
print(date)
#分別把年,月,日抓出來
print(date.day, date.month, date.year)
# 看看該日為星期幾，是該年 (可設定從哪時候開始算) 的第幾個星期
print('Day_name:',date.day_name())
print('weekofyear:',date.weekofyear)

date2 = pd.Timestamp(2022,8,30)
# 相隔幾日
print(date2-date)
# 檢查是否真的差90天
date + pd.Timedelta(days=90) == date2

2022-06-01 00:00:00
1 6 2022
Day_name: Wednesday
weekofyear: 22
90 days 00:00:00

True